<template>
  <FlatLayout align-horizontal="center">
    <div class="about-page">
      <div class="actions">
        <PsiButton :route="resumeRoute">
          Резюме
        </PsiButton>
      </div>
      <div class="text typography-block body-regular">
        <div>
          <h3>Обо мне</h3>
          <p>
            Меня зовут Мосалев Даниил и я .NET разработчик. Начал изучать C# в 2010-ых годах, когда захотелось сделать
            игру в Unity. Но по итогу классическая разработка в коммерческом плане мне показалась практичнее и сейчас я
            работаю с обычными клиент-серверными приложениями. Успешно окончил программу бакалавриата
            <strong>Новосибирского Государственного Технического Университета</strong> в 2021 году, с того же года
            работаю в нём же над системой дистанционного обучения Dispace.
          </p>
          <p>
            Для меня дистанционность - это символ современного IT и один из столпов, которые держат моё желание
            быть разработчиком. Я хочу разрабатывать приложения, которые будут помогать людям решать задачи удалённо,
            без необходимости идти с какими-либо документами в какие-либо организации, а освободившееся время
            посвящать своим интересам. "Госуслуги" - эталон сервиса, решающего скучные задачи. Конечно же, я так же
            хочу работать дистанционно, так как это невероятно комфортно.
          </p>
          <p>
            Так уж получилось, что наибольший опыт работы у меня с веб-технологиями, но заинтересован я именно в .NET:
            у Microsoft получилась уж очень удачная экосистема, в которой приятно находиться. Но это совершенно не
            означает, что я не могу решать задачи с помощью других инструментов. У меня неплохо получается нырять
            в пучины неизвестности, так как это только раззадоривает желание познания. Не стану скрывать, получается не
            всё. Например, с Python совсем не складывается, но это лишь исключение.
          </p>
        </div>
      </div>
    </div>
  </FlatLayout>
</template>

<script setup lang="ts">
import FlatLayout from "@/layouts/FlatLayout/FlatLayout.vue";
import PsiButton from "@/shared/components/PsiButton/PsiButton.vue";
import { computed } from "vue";
import { RouteNames } from "@/router/routeNames.ts";

const resumeRoute = computed(() => {
  return {
    name: RouteNames.ResumeView
  };
});
</script>

<style src="./AboutPage.scss" />
