{
  "layoutHeader": {
    "aboutMe": "Обо мне",
    "projects": "Проекты"
  },
  "auth": {
    "toasterTokenExpiredHeader": "Токен авторизации просрочен",
    "toasterTokenExpiredDescription": "Повторите, пожалуйста, авторизацию"
  },
  "index": {
    "welcome": "Добро пожаловать!",
    "aboutWebsiteHeader": "О сайте",
    "aboutWebsiteContent1": "Этот сайт был создан развлечения ради, чтобы разобраться с контейнеризацией и развёртыванием проекта на удалённом сервере. Плюс хотелось зафиксировать базис клиент-серверной монолитной архитектуры, которую я смогу использовать в дальнейших проектах. Здесь вы найдёте некоторую информацию обо мне и моих проектах. Исходный код",
    "aboutWebsiteContent2": "этого",
    "aboutWebsiteContent3": " проекта доступен на ",
    "aboutWebsiteContent4": "Какие-либо pet-проекты у меня только gamedev характера и направлены чисто для себя, показывать их желания пока нет. Поэтому возникла идея создать этот сайт. Он простой и его статический аналог можно было бы легко создать в блокнотике, но я преследовал цель некой демонстрации своих знаний, чем желание создать практичный продукт."
  },
  "about": {
    "header": "Обо мне",
    "content1": "Меня зовут Мосалев Даниил и я .NET разработчик. Начал изучать C# в 2010-ых годах, когда захотелось сделать игру в Unity. Но по итогу классическая разработка в коммерческом плане мне показалась практичнее и сейчас я работаю с обычными клиент-серверными приложениями. Успешно окончил программу бакалавриата ",
    "content2": "Новосибирского Государственного Технического Университета",
    "content3": "в 2021 году, с того же года работаю в нём же над системой дистанционного обучения Dispace.",
    "content4": "Для меня дистанционность - это символ современного IT и один из столпов, которые держат моё желание быть разработчиком. Я хочу разрабатывать приложения, которые будут помогать людям решать задачи удалённо, без необходимости идти с какими-либо документами в какие-либо организации, а освободившееся время посвящать своим интересам. \"Госуслуги\" - эталон сервиса, решающего скучные задачи. Конечно же, я так же хочу работать дистанционно, так как это невероятно комфортно.",
    "content5": "Так уж получилось, что наибольший опыт работы у меня с веб-технологиями, но заинтересован я именно в .NET: у Microsoft получилась уж очень удачная экосистема, в которой приятно находиться. Но это совершенно не означает, что я не могу решать задачи с помощью других инструментов. У меня неплохо получается нырять в пучины неизвестности, так как это только раззадоривает желание познания. Не стану скрывать, получается не всё. Например, с Python совсем не складывается, но это лишь исключение.",
    "resumeButton": "Резюме"
  },
  "errors": {
    "error404header": "Страница не найдена"
  },
  "toaster": {
    "commonErrorHeader": "Серверная ошибка"
  },
  "pages": {
    "login": "Авторизация",
    "index": "Главная",
    "about": "Обо мне",
    "resume": "Резюме",
    "error404": "Страница не найдена"
  }
}